Autodesk.Revit.UI.UIDocument.SaveAs(Autodesk.Revit.UI.UISaveAsOptions)
Saves the document to a file name obtained from the Revit user.
Remarks:
This method may not be called unless all transactions, sub-transactions, and transaction groups that were opened by the API code were closed.
That also implies that this method cannot be called during dynamic updates.
options:
UI options for the SaveAs operation.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
SaveAs may not be called during dynamic update.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Is not a primary document, it is a linked document.
-or-
SaveAs is temporarily disabled.
-or-
Thrown if there are any transactions, sub-transactions or transaction groups which
were opened by the API code, and not closed. All of these items must be handled
before attempting to close the document.
Throws Autodesk.Revit.Exceptions.OperationCanceledException:
Thrown if saving as is cancelled by an external application during 'DocumentSavingAs' event.
Since:
2016

Autodesk.Revit.UI.UIDocument.SaveAs
Saves the document to a file name obtained from the Revit user without prompting the user ot overwrite a file if it exists.
Remarks:
This method may not be called unless all transactions, sub-transactions, and transaction groups that were opened by the API code were closed.
That also implies that this method cannot be called during dynamic updates.
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
SaveAs may not be called during dynamic update.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Is not a primary document, it is a linked document.
-or-
SaveAs is temporarily disabled.
-or-
Thrown if there are any transactions, sub-transactions or transaction groups which
were opened by the API code, and not closed. All of these items must be handled
before attempting to close the document.
Throws Autodesk.Revit.Exceptions.OperationCanceledException:
Thrown if saving as is cancelled by an external application during 'DocumentSavingAs' event.

Autodesk.Revit.UI.UIDocument.PromptForFamilyInstancePlacement(Autodesk.Revit.DB.FamilySymbol,Autodesk.Revit.UI.PromptForFamilyInstancePlacementOptions)
Prompts the user to place instances of the specified FamilySymbol.
familySymbol: The FamilySymbol.
options: The PromptForFamilyInstancePlacementOptions, to place the family instance according to the options.
Remarks:
This method opens its own transaction, so it's not permitted to be invoked in an active transaction.
In a single invocation, the user can place multiple instances of the input family type until they finish the
placement (with Cancel or ESC or a click elsewhere in the UI). The user will not be permitted to change the type to be placed.
Users are not permitted to change the active view during this placement operation (the operation will be completed).
This method differs from Autodesk.Revit.UI.UIDocument.PostRequestForElementTypePlacement(Autodesk.Revit.DB.ElementType) in that it will execute immediately
within the current API context and return to the application when the user completes or cancels the operation.  However,
it does not allow the user access to user interface options and settings related to the placement.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown when
the family symbol should be of category OST_DuctTerminal because PlaceAirTerminalOnDuct in options is true.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Thrown when
this API method is invoked in an active transaction,
or this document is not active,
or this is a family document and the instances of this family symbol can not exist in the current family,
or this family symbol has no command to create instance,
or the command to create instance is disabled in active view.
Since: 2015

Autodesk.Revit.UI.UIDocument.ShowElements(System.Collections.Generic.ICollection`1{Autodesk.Revit.DB.ElementId})
Shows the elements by zoom to fit.
elementIds: The set of element ids which will be shown.
Remarks: Places all the elements on the screen by moving the view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: elementIds is null.
Throws Autodesk.Revit.Exceptions.ArgumentException: Member of elementIds is null.
Throws Autodesk.Revit.Exceptions.ArgumentException: Member of elementIds is not valid.